app/Cells/CategoryCell.php

    public function render(){
        $category = new Category();
        $categories = $category->dbRead()->findAll();
---
SELECT *
FROM `categories`