app/Controllers/Category.php

SELECT `posts`.`title`, `posts`.`image`, `posts`.`create_at`, `posts`.`slug`, `posts`.`description`, `categories`.`name` as `categoryName`, `users`.`fistName` as `userFirstName`, `users`.`lastName` as `userLastName`
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
WHERE `category_id` = 1
 LIMIT 10
---
    public function index( string $category)
    {

        helper('text');

        if (!array_key_exists($category, $this->categories)){
            $categoryId = 1;
        }else{
            $categoryId = $this->categories[$category];
        }
        echo "<pre>";
        print_r($categoryId);
        echo "</pre>";
        $post = new Post();
        $posts = $post->select([
            'posts.title',
            'posts.image',
            'posts.create_at',
            'posts.slug',
            'posts.description',
            'categories.name as categoryName',
            'users.fistName as userFirstName',
            'users.lastName as userLastName'
        ])->where('category_id', $categoryId)
        ->join(
            'users',
            'users.id = posts.user_id'
        )->join(
            'categories',
            'categories.id = posts.category_id'

        )->findAll(10);