app/Controllers/Recent.php

    public function index()
    {

        helper('text');

        $post = new Post();
        $recent = $post->select([
            'posts.id',
            'posts.title',
            'posts.image',
            'posts.create_at',
            'posts.description',
            'categories.name as categoryName',
            'users.fistName as userFirstName',
            'users.lastName as userLastName'
        ])->join(
            'users',
            'users.id = posts.user_id'
        )->join(
            'categories',
            'categories.id = posts.category_id'

        )->orderBy('id', 'desc')->findAll(7);
---
SELECT `posts`.`id`, `posts`.`title`, `posts`.`image`, `posts`.`create_at`, `posts`.`description`, `categories`.`name` as `categoryName`, `users`.`fistName` as `userFirstName`, `users`.`lastName` as `userLastName`
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
ORDER BY `id` DESC
 LIMIT 7